android/libusb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>libusb must be mounted usbfs</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-07-21 09:23:32 CST"/>
<meta name="author" content="Bian Jiang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">libusb must be mounted usbfs</h1>

<p>
   今天通过libusb访问一个HID的设备，一调用USBDEVFS<sub>CLAIMINTERFACE</sub> 
ioctl就返回-1设备忙, 找了一下午原因也没有找到， 快到下班的时候，
发现了一篇文章<a href="http://android.serverbox.ch/?p=151">Porting Libusb for Android on the Beagleboard in 5 steps</a> 提到
需要把设备加载到usbfs上，结果加载了usbfs设备就能正常访问了。
</p>
<p>  
   在网上搜了一圈，发现libusb就是通过usbfs或usbdevfs来链接USB设备，所以在使用之前
必须加载usbfs到/dev/bus/usb或/proc/bus/usb目录. 原文如下:
</p>

<p class="verse">
libusb uses a pseudo-filesystem known as 'usbdevfs` or 'usbfs` to access<br/>
the USB devices connected to your machine. This filesystem must be mounted<br/>
under /proc/bus/usb for libusb to work.<br/>
</p>


<p>
   libusb移植到Android具体可以参考<a href="#Porting--Libusb--for--Android--on--the--Beagleboard--in--5--steps">Porting Libusb for Android on the Beagleboard in 5 steps</a>
</p>
<p>
需要注意的是:
</p><ul>
<li>在命令行加载sysfs需要执行:
<ul>
<li>mount -t usbfs -o devmode=666 none /dev/bus/usb
</li>
</ul>
</li>
<li>在init.rc中需要使用:
<ul>
<li>mount usbfs none /dev/bus/usb -o devmode=0666
</li>
</ul>
</li>
</ul>
参考
<ul>
<li><a href="http://www.libusb.org/">libusb</a>
</li>
<li><a href="https://github.com/monaka/libusb-android">libusb-android</a>
</li>
<li><a href="http://android.serverbox.ch/?p=151">Porting Libusb for Android on the Beagleboard in 5 steps</a>
</li>
<li><a href="http://groups.google.com/group/beagleboard/browse_thread/thread/cd6707ab3d4bdb95">can't mount usbfs in Android 2.2</a>
</li>
<li><a href="http://blog.chinaunix.net/space.php?uid=20564848&amp;do=blog&amp;id=73832">libusb和HID设备</a>
</li>
</ul>

<div id="postamble">
<p class="author">Author: Bian Jiang</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
